import styles from '@/styles/desctop/About.module.scss'
import Text from '../modules/About/Text'

const About = () => {
	return (
		<div className={styles.about}>
			<div className={styles.about__prew}>
				<div className={styles.about__title}> о бренде</div>
			</div>
			<div className={styles.about__container}>
				<div className={styles.about__content}>
					<Text
						title='	Компания VASSA&Co была основана в России в начале 2000 года с целью
						создания концептуально нового российского бренда, сопоставимого по
						своему уровню с лидерами мировой моды.'
						desc='Также в 2000 году на фабрике была запущена в производство первая в
						России индустриальная линия prêt-a-porter и открыты первые четыре
						магазина VASSA&Co в Москве. Главным дизайнером бренда стала Васса
						(Vassa), стиль и авторский почерк, которой предопредели стратегию
						развития бренда. Опыт работы дизайнера, ее желание разрабатывать
						собственную линию женской одежды, реализуя свои авторские идеи и
						нестандартный подход к современной моде, сформировали настоящий
						стиль VASSA&Co.'
					/>
					<Text
						title='	Компания VASSA&Co была основана в России в начале 2000 года с целью
						создания концептуально нового российского бренда, сопоставимого по
						своему уровню с лидерами мировой моды.'
						desc='Также в 2000 году на фабрике была запущена в производство первая в
						России индустриальная линия prêt-a-porter и открыты первые четыре
						магазина VASSA&Co в Москве. Главным дизайнером бренда стала Васса
						(Vassa), стиль и авторский почерк, которой предопредели стратегию
						развития бренда. Опыт работы дизайнера, ее желание разрабатывать
						собственную линию женской одежды, реализуя свои авторские идеи и
						нестандартный подход к современной моде, сформировали настоящий
						стиль VASSA&Co.'
					/>
					<Text
						title='	Компания VASSA&Co была основана в России в начале 2000 года с целью
						создания концептуально нового российского бренда, сопоставимого по
						своему уровню с лидерами мировой моды.'
						desc='Также в 2000 году на фабрике была запущена в производство первая в
						России индустриальная линия prêt-a-porter и открыты первые четыре
						магазина VASSA&Co в Москве. Главным дизайнером бренда стала Васса
						(Vassa), стиль и авторский почерк, которой предопредели стратегию
						развития бренда. Опыт работы дизайнера, ее желание разрабатывать
						собственную линию женской одежды, реализуя свои авторские идеи и
						нестандартный подход к современной моде, сформировали настоящий
						стиль VASSA&Co.'
					/>
				</div>
			</div>
		</div>
	)
}

export default About
